{
  "host": {
    "name": "Hostname of the remote server. Set up your `~/.ssh/config` such that you can connect to the remote host by the name specified in this field.<br />e.g. `localhost` or `my_host1`",
    "status": "A switch controlling if you are going to use this host. When you would like to stop the submission temporarily, maybe due to maintenance of the server, set this field to `disabled`",
    "work_base_dir": "The path to the work directory. The work directory is the place where jobs are executed. Please specify the directory dedicated to OACIS jobs.<br />e.g. `~/work`",
    "mounted_work_base_dir": "If the work base dir is directly accessible from OACIS, specify the path which is accessible from OACIS. Keep it empty unless you share the volume with the remote host.",
    "max_num_jobs": "The maximum number of concurrent jobs. Jobs are queued until the number of running jobs becomes this number.<br >e.g. `10`",
    "polling_interval": "Time interval to check the status of the computational host. With this interval, SSH connection is made to check the status.<br >e.g. `60`",
    "min_mpi_procs": "The available range of the number of MPI processes. If you specify a number out of this range when making a run, you will get an error.",
    "min_omp_threads": "The available range of the number of OpenMP threads.",
    "executable_simulators": "List of executable simulators on that host.",
    "executable_analyzers": "List of executable analyzers on that host."
   },
   "simulator": {
     "name":"Name of the simulator. Only alphanumeric characters and underscore (‘_’) are available. Must be unique.<br />e.g. `my_great_simulator`",
     "definition_of_parameters":"Input parameter name.<br/>e.g. `param1`", 
     "pre_process_script":"Script executed at the computational host before the job. When no pre-process is necessary, leave it empty.",
     "local_pre_process_script":"Script executed at OACIS server before the job. When no local-pre-preprocess is necessary leave it empty.",
     "command":"The command to execute the simulator. It is recommended to specify it by the absolute path or the relative path from the home directory.<br/>e.g. `~/path/to/my_simulator.out`",
     "print_version_command":"The command to print the simulator version information to standard output. Leave it empty when you do not record the simulator version.",
     "input_type":"How the input parameter is given to the simulator.<br/>Argument: input parameters are given as command line arguments.<br />JSON: input parameters are given by `_input.json` file",
     "support_mpi":"Whether the simulator is an MPI parallel program or not. If you enable this option, you can specify the number of MPI processes when making a Run.",
     "support_omp":"Whether the simulator is an OpenMP parallel program or not. If you enable this option, you can specify the number of OpenMP threads when making a Run.",
     "sequential_seed":"Whether the random number seed is given randomly or in a sequential order for each ParameterSet.",
     "description":"A short explanation of the simulator. The explanation is displayed in the simulator's page. Markdown format is available.",
     "executable_on":"Specify the hosts on which the simulator can be executed. You can select one of these as the computational host when making a Run."
   },
   "analyzer": {
     "name":"Name of the analyzer. Only alphanumeric characters and underscore (‘_’) are available. Must be unique within in each simualtor.",
     "type":"Select `on_run` for a Run-Analyzer. Select `on_parameter_set` for a PS-Analyzer.",
     "definition_of_parameters":"Input parameter name.<br/>e.g. `param1`", 
     "pre_process_script":"Script executed at the computational host before the job. When no pre-process is necessary, leave it empty.",
     "local_pre_process_script":"Script executed at OACIS server before the job. When no local-pre-preprocess is necessary leave it empty.",
     "command":"The command to execute the analyzer. It is recommended to specify it by the absolute path or the relative path from the home directory.<br/>e.g. `~/path/to/my_simulator.out`",
     "print_version_command":"The command to print the simulator version information to standard output. Leave it empty when you do not record the simulator version.",
     "input_type":"How the input parameter is given to the simulator.<br/>Argument: input parameters are given as command line arguments.<br />JSON: input parameters are given by `_input.json` file",
     "files_to_copy":"Specify the files to be copied to `_input/` directory by a pattern. The pattern is used by `Dir.glob` method of Ruby. The default value is the wild card `*`, indicating that all the files are copied by default.",
     "support_mpi":"Whether the analyzer is an MPI parallel program or not. If you enable this option, you can specify the number of MPI processes when making a Run.",
     "support_omp":"Whether the analyzer is an OpenMP parallel program or not. If you enable this option, you can specify the number of OpenMP threads when making a Run.",
     "auto_run":"If this is set, the analyzer is executed automatically each time a Run is finished.",
     "description":"A short explanation of the analyzer. The explanation is displayed in the simulator's page. Markdown format is available.",
     "executable_on":"Specify the hosts on which the simulator can be executed. You can select one of these as the computational host when making a Run.",
     "host_for_auto_run":"The host to which analyzers made by \"auto-run\" is submitted."
   }
}
